app/views/tags/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "taggings" ON "posts"."id" = "taggings"."post_id" WHERE "taggings"."tag_id" = $1  [["tag_id", 1]]
SELECT 1 AS one FROM "posts" INNER JOIN "taggings" ON "posts"."id" = "taggings"."post_id" WHERE "taggings"."tag_id" = $1 LIMIT $2  [["tag_id", 1], ["LIMIT", 1]]
---
<h1><%= @tag.name %></h1>
<% if @tag.posts.empty?  %>