app/views/tags/show.html.erb

    <hr>
    <% if @tag.posts.empty?  %>
---
SELECT "posts".* FROM "posts" INNER JOIN "taggings" ON "posts"."id" = "taggings"."post_id" WHERE "taggings"."tag_id" = $1  [["tag_id", 2]]
SELECT 1 AS one FROM "posts" INNER JOIN "taggings" ON "posts"."id" = "taggings"."post_id" WHERE "taggings"."tag_id" = $1 LIMIT $2  [["tag_id", 2], ["LIMIT", 1]]