app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @posts = @posts.includes(:tags,:user)
---
SELECT "posts".* FROM "posts"
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = $1  [["post_id", 2]]

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "1 Статья"], ["summary", "Какой-то текст"], ["body", "Какой-то текст"], ["created_at", "2021-06-30 18:44:38.338616"], ["updated_at", "2021-06-30 18:44:38.338616"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "summary" = $2, "body" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "Тест"], ["summary", "Тест"], ["body", "Тест"], ["updated_at", "2021-06-30 21:08:55.139066"], ["id", 2]]