app/models/post.rb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = $1  [["post_id", 4]]
---
    def all_tags
      self.tags.map(&:name).join(', ')

SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1 ORDER BY "tags"."id" ASC LIMIT $2  [["name", "Классика"], ["LIMIT", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Классика"], ["created_at", "2021-07-03 16:01:16.230172"], ["updated_at", "2021-07-03 16:01:16.230172"]]
---
    def all_tags=(names)
      self.tags = names.split(',').map do |name|
        Tag.where(name: name.strip).first_or_create!