app/models/user.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "Helder"], ["LIMIT", 1]]
---
  def validate_username
  if User.where(email: username).exists?

SELECT "users".* FROM "users" WHERE (lower(username) = 'logigamer3@gmail.com' OR lower(email) = 'logigamer3@gmail.com') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
def self.find_first_by_auth_conditions(warden_conditions)